Repository: 84000/data-translation-memory
Catalog: toh56-v4.tmx
Source language: bo
Languages: en

source: །བཀའ་སྩལ་པ། དེ་དེ་བཞིན་ནོ། ། ཤཱ་རིའི་བུ་དེ་དེ་བཞིན་ཏེ། ཤཱ་རིའི་བུ་སེམས་ཅན་གྱི་ཁམས་ནི་རབ་ཏུ་མང་གི །སའི་ཁམས་ནི་དེ་ལྟ་མ་ཡིན། ཆུའི་ཁམས་ནི་དེ་ལྟ་མ་ཡིན། མེའི་ཁམས་ནི་དེ་ལྟ་མ་ཡིན། རླུང་གི་ཁམས་ནི་དེ་ལྟ་མ་ཡིན་ནོ། ། ཡང་ཤཱ་རིའི་བུ་སེམས་ཅན་སྐལ་བ་མཉམ་པར་གྱུར་པ་འདི་ལས་ཕྱི་རོལ་གྱི་དྲང་སྲོང་གི་ལྷའི་མིག་ལ་སྣང་བར་མ་གྱུར་པ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ལྷའི་མིག་ལ་སྣང་བར་མ་གྱུར་པ་ཡོད་དོ། ཤཱ་རིའི་བུ་གང་ཤིང་རྟའི་འཁོར་ལོ་ཙམ་གྱི་ཁྱོན་ལ་དེ་བཞིན་གཤེགས་པའི་ལྷའི་སྤྱན་ལ་སྣང་བར་གྱུར་པ་དེ་ནི་རབ་ཏུ་མང་སྟེ། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ལྷ་དང་མིར་བཅས་པའི་སྐྱེ་དགུ་ནི་དེ་ལྟ་མ་ཡིན་ཏེ། དེ་ལྟར་སེམས་ཅན་གྱི་ཁམས་དཔག་ཏུ་མེད་དོ། །
en: “Exactly, Śāriputra, exactly. The largest element, Śāriputra, is the element of sentient beings, not the earth element, the water element, the fire element, or the wind element. Still, Śāriputra, the fortunate sentient beings cannot be perceived by the divine sight of seers of other traditions, or by that of the śrāvakas or pratyekabuddhas. Śāriputra, those sentient beings who are otherwise invisible can be seen by divine sight of the Tathāgata, and there are many more such invisible beings in an area the size of a cart wheel than there are gods and human beings in all the threefold thousand great thousand worlds. This is how incalculable the element of sentient beings is.

source: ཤཱ་རིའི་བུ་ཇི་ཙམ་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་སེམས་ཅན་སྒོ་ང་ལས་སྐྱེ་བའམ། མངལ་ནས་སྐྱེ་བའམ། དྲོད་གཤེར་ལས་སྐྱེ་བའམ། རྫུས་ཏེ་ སྐྱེ་བའམ། གཟུགས་ཅན་ནམ། གཟུགས་མེད་པའམ། འདུ་ཤེས་ཅན་ནམ། འདུ་ཤེས་མེད་པའམ། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་ནམ། སྣང་བའམ། མི་སྣང་བའམ། ཇི་ཙམ་སེམས་ཅན་གྱི་ཁམས་སུ་བཏགས་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། སྐད་ཅིག་ཐང་ཅིག་ཡུད་ཙམ་ཅིག་ལ་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ། དེ་དག་ཐམས་ཅད་མིར་གྱུར་ནས་ཀྱང་སྨན་པར་གྱུར་ཏེ། ཚེའི་ཚད་ཀྱང་བསྐལ་པར་གནས་པར་གྱུར་ནས་ཡོངས་སུ་བརྟག་པ་བཟུང་སྟེ། སློབ་དཔོན་ཁམས་གསོ་བ་ལ་མཁས་པ་འདི་ལྟ་སྟེ། །ཤཱ་རིའི་བུ་ད་ལྟར་གྱི་སྨན་པའི་རྒྱལ་པོ་གསོ་བྱེད་ལྟ་བུ་དེ་དག་ཐམས་ཅད་འདུས་ནས་ སེམས་ཅན་གཅིག་གི་འདོད་ཆགས་ཀྱི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་། ཞེ་སྡང་གི་གདུང་བ་དང་། གཏི་མུག་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར་འབད་ཅིང་སྨན་པ་རེ་རེས་ཀྱང་བསིལ་བའི་ཡན་ལག་གི་སྨན་རི་རབ་ཙམ་གྱི་ཕུང་པོ་བསྡུས་ནས་ དེ་དག་ཐམས་ཅད་སེམས་ཅན་གཅིག་གི་འདོད་ཆགས་ཀྱི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར་བསིལ་བའི་ཡན་ལག་གི་སྨན་གྱི་ཕུང་པོ་བཏགས་ཏེ བསྐུས་པར་གྱུར་ཀྱང་ཤཱ་རིའི་བུ་སྨན་པ་ཚེའི་ཚད་བསྐལ་པར་གནས་པ་ཐམས་ཅད་སྐྱོ་བར་གྱུར་ལ། བསིལ་བའི་ཡན་ལག་གི་སྨན་གྱི་ཕུང་པོ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་འགྲིབས་ཤིང་ཟད་པར་གྱུར་ཀྱང་སེམས་ཅན་གཅིག་གི་འདོད་ཆགས་ཀྱི་གདུང་བ་དང་། ཞེ་སྡང་གི་གདུང་བ་དང་། གཏི་མུག་གི་གདུང་བ་དེ་རབ་ཏུ་ཞི་བར་མི་ནུས། དེ་ལྟར་དེ་བཞིན་གཤེགས་པས་མི་སྡུག་པའི་ཆོས་ཀྱི་སྨན་དང་། རྩིས་བསྐུ་བའི་སྦྱོར་བས་ནི་སེམས་ཅན་དུ་མ་སེམས་ཅན་བརྒྱ་ཕྲག་དུ་མ། སེམས་ཅན་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་བརྒྱ་སྟོང་ཕྲག་དུ་མ། སེམས་ཅན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་དུ་མ། སེམས་ཅན་ཁྲག་ཁྲིག་དཀྲིགས་ཕྲག་དུ་མ། སེམས་ཅན་གཏམས་ཕྲག་དུ་མ་ནས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སེམས་ཅན་རྣམས་ཀྱི་འདོད་ཆགས་ཀྱི་གདུང་བ་མི་སྡུག་པའི་སྨན་དང་། རྩིས་བསྐུ་བའི་སྦྱོར་བས་རབ་ཏུ་ཞི་བར་བྱེད་དོ། བྱམས་པའི་ཆོས་ཀྱི་སྨན་དང་། རྩིས་བསྐུ་བའི་སྦྱོར་བས་སེམས་ཅན་དུ་མའི་ཞེ་སྡང་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་དེ། བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སེམས་ཅན་རྣམས་ཀྱི་ཞེ་སྡང་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་དོ། ། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་སྨན་དང་། རྩིས་བསྐུ་བའི་སྦྱོར་བས་སེམས་ཅན་དུ་མའི་གཏི་མུག་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་དེ། བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་སེམས་ཅན་རྣམས་ཀྱི་གཏི་མུག་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་དོ། ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་སྐུ་ཐོབ་པས་ཀྱང་བདག་ཉིད་ཆོས་ཀྱི་སྨན་དུ་གྱུར་པར་བྱིན་གྱིས་བརླབས་ནས་སེམས་ཅན་དུ་མའི་འདོད་ཆགས་ཀྱི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད། ཞེ་སྡང་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད། གཏི་མུག་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་དོ། ། སེམས་ཅན་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །
en: “Śāriputra, imagine all the sentient beings in the threefold thousand great thousand worlds, however many they may be—those born from eggs, those born from wombs, those born from moisture, those born spontaneously, those with form, those without form, those with perception, those without perception, those with neither perception nor nonperception, the visible, and the invisible. Imagine that they all at some moment, on some occasion, at some time, sooner or later, were to achieve a human state of existence and then become masters of medicine, expert doctors. Then, Śāriputra, imagine that, in an attempt to do the same as the present king of physicians, they all assembled and attempted to relieve the affliction of desire, to relieve the affliction of anger, and to relieve the affliction of confusion in a single sentient being. Imagine that each of the doctors mustered as much cooling medicine as the whole mass of Mount Sumeru, and that all this cooling medicine was prepared and applied to a single sentient being, in order to relieve the affliction of desire. Śāriputra, even if all these doctors were to apply themselves for enough lifetimes to fill an eon, they would become exhausted, and all their heaps of cooling medicine would be used up before they could relieve the affliction of desire, the affliction of anger, and the affliction of confusion in this one sentient being. But the Tathāgata, by means of the medicine of the Dharma, the healing balm of disgust, can relieve the affliction of desire in many sentient beings, many hundreds of sentient beings, many thousands of sentient beings, many hundreds of thousands of sentient beings, many hundreds of thousands of millions of trillions of sentient beings, many thousands of billions of trillions of sentient beings, so many sentient beings that it cannot be put into words. He does this by means of the medicine of the Dharma, the healing balm of disgust. He can, by means of the medicine of the Dharma, the healing balm of love, relieve the affliction of anger in many sentient beings. He can relieve the affliction of anger in so many sentient beings that it cannot be put into words. He can, by means of the medicine of the Dharma, the healing balm of dependent arising, relieve the affliction of confusion in many sentient beings. He can relieve the affliction of confusion in so many sentient beings that it cannot be put into words. Mastering the Dharma body, the bodhisatva, the great being, himself serves as a doctor of the Dharma, and he can relieve the affliction of desire, the affliction of anger, and the affliction of confusion in many sentient beings. He can relieve the afflictions of desire, anger, and confusion in so many sentient beings that it cannot be put into words.

source: དེ་བས་ན་ཤཱ་རིའི་བུ་རྣམ་གྲངས་འདིས་ཀྱང་འདི་ལྟར་རིག་པར་བྱ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཆོས་ཀྱི་སྐུ་ལ་གནས་ནས་ བདག་ཉིད་ཆོས་ཀྱི་སྨན་དུ་གྱུར་པར་བྱིན་གྱིས་བརླབས་ནས་སེམས་ཅན་དུ་མ་ནས་སེམས་ཅན་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་བར་གྱི་འདོད་ཆགས་ཀྱི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད། ཞེ་སྡང་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད། གཏི་མུག་གི་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱེད་དོ། །
en: “Śāriputra, one should take this explanation to heart. One should take to heart that the bodhisatva who bases himself upon the Dharma body can himself serve as a doctor of the Dharma and relieve the affliction of desire, the affliction of anger, and the affliction of confusion in many sentient beings, and so forth, so many that it cannot be put into words.

source: ཤཱ་རིའི་བུ་ངས་མངོན་པར་ཤེས་པ་བསྐལ་པ་གྲངས་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཅེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཞེས་བྱ་བའི་བར་དུའོ། །འདི་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་དེས། ང་ལ་གཞོན་ནུ་ཁྱོད་མ་འོངས་པའི་དུས་བསྐལ་པ་གྲངས་མེད་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་ཏོ། ། ཡང་ཤཱ་རིའི་བུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མར་མེ་མཛད་ཀྱིས་ལུང་བསྟན་མ་ཐག་ཏུ་ངས་ཆོས་ཀྱི་སྐུ་ཐོབ་པར་གྱུར་ཏེ། ང་ཆོས་ཀྱི་སྐུ་དང་ལྡན་པར་གྱུར་ནས། མར་མེ་མཛད་ཀྱི་འོག་ཏུ་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་མིག་མཛེས་ཞེས་བྱ་བ་སུམ་ཅུ་རྩ་གསུམ་པ་རྣམས་ཀྱི་བདག་པོ་རྫུ་འཕྲུལ་ཆེ་བ། མཐུ་ཆེ་བ། དབང་ཆེ་བར་གྲགས་པར་གྱུར་ཏོ། །
en: “Śāriputra, I can see clearly across incalculable eons, and much more than that, that a tathāgata by the name of Dīpaṅkara appeared in the world. He was perfect in wisdom and conduct, and so forth, awakened, a lord. The Lord Dīpaṅkara, the tathāgata, the arhat, the fully accomplished Buddha, made a prophesy concerning me, saying, ‘Young man, uncountable eons in the future, you will become a tathāgata, arhat, fully accomplished buddha by the name of Śākyamuni.’ Śāriputra, when the Lord Dīpaṅkara, the tathāgata, the arhat, the fully accomplished Buddha, made this prophesy, I attained the Dharma body. Because I possessed the Dharma body, after encountering Dīpaṅkara I attained the position of Śakra. I was named Sunetra, and I was chief among the gods, the ruler of the Heaven of the Thirty-Three, with great magical abilities and great powers, renowned as a great lord.

source: ཡང་དེའི་ཚེ་འཛམ་བུའི་གླིང་འདིར་གྲོང་ཁྱེར་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཕྲག་བཞི་བྱུང་ངོ་། ། གྲོང་དང་། ཚོང་འདུས་དང་། རི་ཁྲོད་སྟོང་ཕྲག་མང་པོ་བྱུང་སྟེ། གྲོང་ཁྱེར་ཆེན་པོ་དང་། ཚོང་འདུས་དང་། རི་ཁྲོད་སྟོང་ཕྲག་མང་པོ་དེ་དག་ཐམས་ཅད་ཀྱང་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་མང་པོས་གང་བར་གྱུར་ཏོ། ། ཡང་དེའི་ཚེ་ནད་ཆེན་པོའི་བསྐལ་པ་བར་མ་བྱུང་སྟེ། སེམས་ཅན་ཕལ་ཆེར་ལུས་རྨ་ཅན་དུ་གྱུར་ཏེ། ལུས་རུལ་བ་དང་། ཝ་བ་དང་། འབྲས་དང་། མེ་དབལ་དང་། གཡན་པ་དང་། རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་གྱིས་རྒྱས་པར་གྱུར་ཏོ། ། དེ་ན་སྨན་པ་བརྒྱ་སྟོང་ཕྲག་མང་པོ་སེམས་ཅན་དེ་དག་གི་ནད་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་བརྩོན་པར་བྱེད་དོ། ། ཤཱ་རིའི་བུ་དེ་ནས་སེམས་ཅན་དེ་དག་གསོ་བ་མ་རྙེད་དེ། མགོན་མེད་སྐྱབས་མེད་ནས་སྒྲ་ཆེན་པོ་ཕྱུང་བ།
en: “At that time there were eighty-four thousand great cities on the Jambu continent. There were many thousands of towns, villages, and hamlets. All these many thousands of towns, villages, and hamlets were filled with many hundreds of thousands of millions of trillions of beings. Once, a great plague broke out, and these sentient beings suffered from a great many painful symptoms, with sores on their bodies, swellings, boils, inflammations, itches, rashes, and disorders of wind, bile, and phlegm. Many hundreds and thousands of physicians attempted to alleviate the sickness of these sentient beings. Then, Śāriputra, these sentient beings, who had no effective cure, who had no help and no protection, cried out:

source: ལྷ་དག་དང་ནི་ཀླུ་རྣམས་དང་། །གནོད་སྦྱིན་དྲི་ཟ་སྲིན་པོ་དང་། །མི་དང་མི་མ་ཡིན་པ་དག ། བདག་ཅག་ནད་ལས་ཐར་བྱེད་གང་། །
en: “ ‘Are there no gods or nāgas, Yakṣas, gandharvas, or rākṣasas, Human beings or nonhuman beings, Who can free us from these diseases?

source: བདག་ཅག་སྡུག་བསྔལ་ཐར་བྱེད་ལ། །ནོར་རྣམས་ཐམས་ཅད་སྦྱིན་པར་བྱ། ། དེ་ཡི་བཀའ་ཡི་རྗེས་སུ་འཇུག ། བྱས་པ་དང་དག་ཀྱང་གཟོ་བར་བྱ།། །།
en: “ ‘We will give up our riches, We will follow their prescriptions. We will be truly grateful If anyone can free us from this suffering.’

source: ཡང་ཤཱ་རིའི་བུ་ངས་མིའི་ལས་འདས་པའི་ལྷའི་མིག་རྣམ་པར་དག་པས་སེམས་ཅན་དེ་དག་ནད་ཀྱིས་གཟིར་ཏེ། དེ་དག་ཕལ་ཆེར་ལུས་རྨ་ཅན་དུ་གྱུར་ཏེ། ལུས་རུལ་བ་དང་། ཝ་བ་དང་། འབྲས་ད་ང་། མེ་དབལ་དང་། གཡན་པ་དང་། རླུང་དང་། མཁྲིས་པ་དང་། བད་ཀན་གྱིས་རྒྱས་པ་མཐོང་། མིའི་ལས་འདས་པ་ལྷའི་རྣ་བ་རྣམ་པར་དག་པས་སེམས་ཅན་དེ་དག་གིས་སྒྲ་ཆེར་ཕྱུང་བ་ཐོས་ཏེ། མཐོང་ཞིང་ཐོས་ནས་སེམས་ཅན་དེ་དག་ལ་སྙིང་རྗེ་ཆེན་པོ་སྐྱེས་ཏེ། དེ་དག་ལ་ངས་འདི་སྙམ་དུ་བསམས་སོ། ། ང་སེམས་ཅན་འདི་དག་གི་གནས་སུ་གྱུར་ཅིག ། སེམས་ཅན་སྐྱབས་མེད་པ་རྣམས་ཀྱི་སྐྱབས་སུ་གྱུར་ཅིག ། སེམས་ཅན་རྟེན་མེད་པ་རྣམས་ཀྱི་རྟེན་དུ་གྱུར་ཅིག ། སེམས་ཅན་གསོ་བ་མེད་པ་རྣམས་གསོ་བ་སྦྱར་བར་བྱའོ་སྙམ་སྟེ།
en: “Śāriputra, by means of my pure divine sight, which is beyond anything human, I saw these sentient beings tormented by disease, suffering from a great many painful symptoms, with sores on their bodies, swellings, boils, inflammations, itches, rashes, and disorders of wind, bile, and phlegm. With my divine hearing, which is beyond anything human, I heard these sentient beings crying out loudly. When I saw them and heard them, great compassion for these sentient beings arose within me, and I thought to myself, ‘I will be a resting place for these sentient beings. I will be a protector for sentient beings who have no protection. I will be a refuge for sentient beings without a refuge. I will provide a cure for sentient beings who have no cure.’

source: ཤཱ་རིའི་བུ་ངས་བརྒྱ་བྱིན་གྱི་ལུས་ཆེན་པོ་མི་སྣང་བར་བྱས་ནས་གྲོང་ཁྱེར་ཆེན་པོ་ཀུ་རུ་ནས་ཤིན་ཏུ་མི་རིང་བ་ཞིག་ཏུ་དེས་པ་ཞེས་བྱ་བའི་སྲོག་ཆགས་ཞིག་ཏུ་བརྫུས་ཏེ་སྐྱེས་ནས་ སྟེང་གི་བར་སྣང་ལ་འདུག་སྟེ འཛམ་བུའི་གླིང་གི་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བསྐུལ་ཏོ། །
en: Then, Śāriputra, concealing that I was the great Śakra, I came into existence spontaneously, not far from the great city of Kuru, as a being by the name of Saumya. From a seat in the sky I then encouraged all the beings on the Jambu continent with these verses:

source: གྲོང་ཁྱེར་ཀུ་རུ་ནས་ནི་མི་རིང་ན། །
en: “ ‘Not far from the city of Kuru

source: དེས་པ་ཞེས་བྱའི་སྲོག་ཆགས་རྣམ་པ་ཡོད། །
en: There is a being by the name of Saumya,

source: གང་དག་དེ་ཡི་ཤ་ལ་ཡོངས་ཟ་བ། །དེ་ཀུན་ནད་ལས་ཡོངས་སུ་ཐར་བར་འགྱུར། །
en: And those who eat his flesh Will all become free from disease.

source: འཇིགས་ཤིང་སྐྲག་པ་དག་ཏུ་མ་བྱེད་པར། །དེ་ཡི་ཤ་ནི་ཇི་ལྟར་འདོད་དགར་ལོང་། །
en: “ ‘Do not be scared. Do not be frightened. Enjoy his flesh. Eat it as you wish.

source: དེ་ནི་གནོད་པར་མི་སེམས་ཁྲོ་གཤེ་མེད། །
en: He will not be angry. He will not be furious.

source: དེ་ནི་འཛམ་བུའི་གླིང་གི་རྩི་ཡིན་ནོ། །
en: He is medicine for the Jambu continent.’

source: དེ་ལྟར་ཤཱ་རིའི་བུ་གྲོང་ཁྱེར་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཕྲག་བཞི་པོ་དེ་དག་དང་། གྲོང་དང་། གྲོང་ཁྱེར་དང་། ཚོང་འདུས་དང་། རི་ཁྲོད་སྟོང་པོ་དེ་དག་ན་སེམས་ཅན་ན་བ་ཇི་སྙེད་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱིས་སྒྲ་དེ་ཐོས་ནས་ གྲོང་ཁྱེར་ཆེན་པོ་ཀུ་རུ་ཞེས་བྱ་བ་ག་ལ་བ་དང་། སྲོག་ཆགས་ཀྱི་རྣམ་པ་དེས་པ་གང་ན་ཡོད་པ་དེར་སོང་སྟེ ཕྱིན་ནས་སྲོག་ཆགས་དེས་པ་ཞེས་བྱ་བའི་ལུས་ལས་ཤ་བཅད་ཅིང་བཅད་ཅིང་ཁྱེར་ཡང་དེའི་ལུས་ལས་ཤ་ཡོངས་སུ་ཟད་པར་མ་གྱུར་ཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་བྱུང་ངོ་། །
en: “Then, Śāriputra, when all the diseased sentient beings in the eighty-four thousand great cities, and in the thousands of other cities, towns, villages, and hamlets, heard this, they came to the great city of Kuru where the being Saumya was staying. They cut the flesh from his body and took it away, but his flesh was not depleted. Then this verse issued forth:

source: གང་ཕྱིར་བདེན་པས་བྱང་ཆུབ་རེག་འགྱུར་ཞིང་། །ཡེ་ཤེས་ཕུང་པོ་དེ་ཟད་མི་འགྱུར་ཏེ། །
en: “ ‘Because I speak the truth, I will reach awakening, And this skandha of knowledge will not be exhausted.

source: ང་ཡི་ཚིག་དེ་བདེན་པར་འགྱུར་ཞེ་ན། །ལུས་ལ་ཤ་ནི་ནམ་ཡང་ཟད་མ་གྱུར། །
en: My undeceitful words are “May the flesh of my body not be depleted.” ’

source: དེ་ལྟར་ཤཱ་རིའི་བུ་འཛམ་བུའི་གླིང་ཀུན་གྱི་སྐྱེ་བོའི་ཚོགས་ཐམས་ཅད་ཀྱིས་དེས་པ་ཞེས་བྱ་བའི་སྲོག་ཆགས་ཀྱི་ཤ་བཅད་ཅིང་བཅད་ཅིང་ཁྱེར་ཡང་དེའི་ལུས་བྲི་བའམ། གང་བར་ཡང་མི་མངོན་ཏེ ཤ་ཡང་ཡང་བཅད་ཀྱང་སླར་དེ་བཞིན་དུ་སྐྱེའོ། ། ཡང་ཤཱ་རིའི་བུ་གང་སེམས་ཅན་ན་བ་རྣམས་ཀྱིས་དེས་པ་ཞེས་བྱ་བའི་སྲོག་ཆགས་ཀྱི་ཤ་ཟོས་ན་དེ་དག་གི་ནད་ཐམས་ཅད་བྱང་སྟེ། ནད་མེད་ཅིང་བདེ་བ་ལས་མི་འགྱུར་བར་གྱུར་ཏོ། ། དེ་བཞིན་དུ་མཐར་གྱིས་འཛམ་བུའི་གླིང་ནན་བ་ཐམས་ཅད་ཀྱི་ནད་སྣ་ཚོགས་བྱང་སྟེ། ནད་མེད་པར་བྱས་ནས་བདེ་ཞིང་གྱུར་པ་མེད་དོ། །
en: “So it was, Śāriputra, that a host of sentient beings from all over the Jambu continent continued to cut the flesh from Saumya’s body and carry it away, yet his body showed no sign of either shrinking or growing. Even though they cut the flesh from it again and again, it remained the same. Śāriputra, those sentient beings who were sick ate Saumya’s flesh, and all their ailments were removed. They became free from illness and regained their health. In due course, all those on the Jambu continent who were suffering from various kinds of disease were healed. They became free from illness and regained their health.

source: དེ་ནས་འཛམ་བུའི་གླིང་གི་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། མི་ཐམས་ཅད་འདི་སྙམ་དུ་སེམས་ཏེ། དེས་པ་ཞེས་བྱ་བའི་སྲོག་ཆགས་དེས་བདག་ཅག་ནད་ལས་ཡོངས་སུ་ཐར་ཏེ་བདེ་ཞིང་གྱུར་པ་མེད་པར་བྱས་ན། བདག་ཅག་གིས་དེ་ལ་མཆོད་པ་དང་། བཀུར་སྟི་ཅི་ཞིག་བྱ་སྙམ་སྟེ། དེ་དག་ཐམས་ཅད་གཅིག་ཏུ་འདུས་སོ། ། འདུས་ནས་དེས་པ་ཞེས་བྱ་བའི་སྲོག་ཆགས་ག་ལ་བ་དེར་སོང་སྟེ། ཕྱིན་ནས་སྲོག་ཆགས་དེས་པ་ལ་ཁོར་ཡུག་ཏུ་བསྐོར་ཏེ་སླར་ཚིགས་སུ་བཅད་པ་འདི་སྨྲས་སོ། །
en: “Then the men, women, boys, and girls of the Jambu continent thought to themselves, ‘How should we honor and worship this being Saumya, who has freed us from disease and restored us to health?’ They gathered together and went to the place where Saumya was staying. When they had arrived there, they gathered around Saumya and spoke this verse to him:

source: ཁྱོད་ནི་གནས་དང་སྐྱབས་ལགས་ཏེ། །
en: “ ‘You are a refuge. You are a protector.

source: ཁྱོད་ནི་སྨན་པ་ཁྱོད་ཉིད་སྨན། །ཁྱོད་ལ་མཆོད་པ་ཅི་བགྱི་བ། །བདག་ཅག་ལ་ནི་བཀའ་སྩོལ་ཅིག །
en: You are a doctor. You are medicine. Please tell us How we can repay you.’

source: ཤ་རིའི་བུ་ཨེ་མའོ་སྐྱེ་བོའི་ཚོགས་རྣམས་འདུན་པར་གྱུར་ཏོ་སྙམ་དུ་ངས་ཤེས་ནས་ལུས་ཆེན་པོ་དེ་མི་སྣང་བར་བྱས་ཏེ། རང་གི་བརྒྱ་བྱིན་གྱི་ཆ་བྱད་དུ་འདུག་ནས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་དག་ལ་སྨྲས་པ། ཀྱེ་གྲོགས་པོ་དག་ང་ལ་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་མི་དགོས་སོ། ། གྲོགས་པོ་དག་ང་ལ་ཞིང་གི་དངོས་པོ་དང་། ཁྱིམ་གྱི་དངོས་པོ་དང་། ཚོང་འདུས་ཀྱི་དངོས་པོ་དང་། འགྲོན་བུ་དང་། གསེར་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། བཻ་དཱུརྱ་དང་། དུང་དང་། མན་ཤེལ་དང་། བྱི་རུ་རྣམས་མི་དགོས་སོ། ། གྲོགས་པོ་དག་ང་ལ་གླང་པོ་ཆེ་དང་། རྟ་དང་། རྔ་མོ་དང་། བ་ལང་དང་། བོང་བུ་དང་། ལུག་དང་། ཁྱིམ་བྱ་དང་། ཕག་རྣམས་མི་དགོས་སོ། ། སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། ཞོ་ཤས་འཚོ་བའི་མི་རྣམས་ཀྱང་མི་དགོས་སོ། ། བཟའ་བ་དང་། བཏུང་བ་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་དང་། སྐྱེད་མོས་ཚལ་དང་། དཀའ་ཐུབ་ཀྱི་ནགས་ཚལ་གྱི་ལོངས་སྤྱོད་རྣམས་ཀྱང་མི་དགོས་སོ། ། ཀྱེ་གྲོགས་པོ་དག་ཁྱེད་ཀྱིས་སྲོག་གཅོད་པ་སྤོངས་ལ་སྲོག་གཅོད་པ་ལས་སླར་ལྡོག་པར་གྱིས་ཤིག །མ་བྱིན་པར་ལེན་པ་སྤོངས་ལ། མ་བྱིན་པར་ལེན་པ་ལས་སླར་ལྡོག་པར་གྱིས་ཤིག །འདོད་པས་ལོག་པར་གཡེམ་པ་སྤོངས་ལ། འདོད་པས་ལོག་པར་གཡེམ་པ་ལས་སླར་ལྡོག་པར་གྱིས་ཤིག །བརྫུན་དུ་སྨྲ་བ་སྤོངས་ལ། བརྫུན་དུ་སྨྲ་བ་ལས་སླར་ལྡོག་པར་གྱིས་ཤིག །ཕྲ་མ་སྤོངས་ལ། ཕྲ་མ་ལས་སླར་ལྡོག་པར་གྱིས་ཤིག །དེ་བཞིན་དུ་སྦྱར་ཏེ་ངག་རྩུབ་པོ་དང་། ཚིག་ཀྱལ་པ་དང་། བརྣབ་སེམས་དང་། གནོད་སེམས་དང་། ལོག་པར་ལྟ་བའི་བར་དུ་སྤོངས་ལ། ལོག་པར་ལྟ་བ་ལས་སླར་ལྡོག་པར་གྱིས་ཤིག །
en: “What a crowd it was that had gathered, Śāriputra. Acknowledging this, I made the massive body disappear, and standing there with the appearance of Śakra, I addressed the huge crowd: ‘My friends, I am not interested in cities, towns, villages, kingdoms, or royal courts. My friends, I am not interested in land, buildings, businesses, riches, gold, jewels, pearls, gems, shells, crystals, or coral. My friends, I am not interested in elephants, horses, camels, cows, donkeys, sheep, cocks, or pigs, in women, men, sons, daughters, servants, workers, or laborers, or in the pleasures of food, drink, bedding, seats, medicine for the sick, utensils, parks, or groves. Rather, my friends, you should avoid taking life. Turn away from the act of taking life. You should avoid taking what is not given. Turn away from the act of taking what is not given. You should avoid sexual misconduct. Turn away from the act of sexual misconduct. You should avoid lying. Turn away from the act of lying, and so forth. You should avoid harsh language, inane chatter, covetousness, malice, and wrong views. Turn away from the act of holding wrong views.’

source: དེའི་ཚེ་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །
en: “Then these verses were spoken to that great host of beings:

source: ང་ལ་འགྲོན་བུ་བྱེ་བ་མི་དགོས་ཏེ། །
en: “ ‘I have no interest in wealth in the millions,

source: གསེར་ཕུང་རི་རབ་ཙམ་ཡང་དགོས་པ་མེད། །
en: In mountains of gold the size of Meru,

source: བུད་མེད་ལྷ་མོ་འདྲ་བ་མི་དགོས་ཏེ། །
en: In women who look like nymphs,

source: བཟའ་དང་བཏུང་དང་ཁ་ཟས་ཟས་མི་དགོས། །
en: Or in enjoying food and drink.

source: དེས་པའི་སྲོག་ཆགས་ལ་ནི་མཆོད་འདོད་ན། །
en: “ ‘If you wish to repay the being called Saumya,

source: ལས་ཀྱི་ལམ་ནི་རབ་དག་བཅུ་པོ་འདི། །ཐམས་ཅད་འདུས་ནས་དེ་དག་བསྲུང་བར་གྱིས། །ཕན་ཚུན་དུ་ཡང་བྱམས་པའི་ཡིད་ཀྱིས་ལྟོས། །
en: Follow the path of excellent conduct, These ten points that cover it all, And maintain minds filled with love for one another.

source: ལས་ལམ་བཅུ་པོ་རྫོགས་པ་འདི་དག་རྣམས། །ཐམས་ཅད་གཅིག་ཏུ་འདུས་ཏེ་སྲུངས་ཤིག་དང་། །དེ་ཚེ་ང་ལ་མཆོད་པ་བྱས་པར་འགྱུར། །བྱང་ཆུབ་སེམས་དཔའ་ནོར་དང་འབྲུ་མི་ཚོལ། །
en: “ ‘Abide by the tenfold path of action, Which encompasses everything, in full. This is how you can honor me—Bodhisatvas have no interest in hoarding riches.

source: ང་ལ་ནོར་རྣམས་དགོས་པ་མ་ཡིན་ཏེ། །
en: “ ‘I have no interest in wealth,

source: བཟའ་བཏུང་དག་དང་དབྱིག་ནོར་འབྲུ་མི་དགོས། །
en: Food or drink, money, riches, or grain,

source: རྟ་དང་གླང་ཆེན་ཤིང་རྟ་མི་དགོས་ཏེ། །
en: In horses, elephants, or chariots,

source: བུད་མེད་མཆོག་དང་རིན་ཆེན་གོས་མི་དགོས། །
en: Or in women of high standing or fine clothing.

source: ཕན་ཚུན་དུ་ནི་བྱམས་སེམས་དག་པ་དང་། ཕན་པའི་དངོས་པོ་དག་གི་སེམས་བསྐྱེད་ལ། །ཐམས་ཅད་ཀུན་ཀྱང་གཅིག་ཏུ་འདུས་གྱུར་ལ། །དགེ་བཅུའི་ལས་ལམ་དག་རྫོགས་བསྲུང་བར་གྱིས།
en: “ ‘Keep to that which encompasses all— The perfectly pure ten wholesome forms of conduct— And cultivate a loving attitude for one another, An attitude of wanting to help.’

source: །དབང་པོས་མི་རྣམས་དེ་དག་རབ་བསྐུལ་བ། །ཚིག་དེ་དག་ནི་ཐོས་པར་གྱུར་པ་དང་། །དགེ་བ་བཅུ་ཡི་ལས་ལམ་རྣམ་དག་པ། །དགེ་བ་རྣམས་ནི་ཡང་དག་རབ་ཏུ་ལེན། །
en: “These were the words they heard As Purandara exhorted the men To take up what is wholesome, The pure path of the ten wholesome forms of conduct.

source: ཤཱ་རིའི་བུ་ངས་སྐྱེ་བོའི་ཚོགས་ཆེན་པོ་དེ་དག་ལ་ཆོས་ཀྱི་གཏམ་ཀུན་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཙུད། ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས་ནས་དེ་ཉིད་དུ་མི་སྣང་བར་གྱུར་པ་དེ་ནི་ང་ཡིན་ནོ། །ཤཱ་རིའི་བུ་ངས་མངོན་པར་ཤེས་ཏེ་འཛམ་བུའི་གླིང་གི་སྐྱེས་པ་དང་། བུད་མེད་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། མི་དེ་སྙེད་ཐམས་ཅད་ཀྱིས་སྲོག་ཆགས་དེས་པ་ཞེས་བྱ་བའི་ཤ་ཟོས་པ་ལས་ཐ་ན་སེམས་ཅན་གཅིག་ཀྱང་དེ་ནས་འཆི་བའི་དུས་བྱས་ཏེ། ཤི་འཕོས་ནས་ལོག་པར་ལྟུང་བར་སོང་བར་མ་གྱུར་ཏེ། དེ་དག་ཐམས་ཅད་དེ་ནས་ཤི་འཕོས་འཆི་བའི་དུས་བྱས་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་དང་སྐལ་བ་མཉམ་པར་སྐྱེས་སོ། །ཤཱ་རིའི་བུ་ངས་དེ་དག་ལ་ཆོས་ཀྱི་གཏམ་ཀུན་བསྟན། ཡང་དག་པར་འཛིན་དུ་བཅུག ། ཡང་དག་པར་གཟེངས་སྟོད། ཡང་དག་པར་རབ་ཏུ་དགའ་བར་བྱས་ནས་དེ་དག་ཐམས་ཅད་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་དང་། བླ་ན་མེད་པའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་དང་། ཐེག་པ་གསུམ་ལ་ངེས་པར་གྱུར་ཏེ དེ་ལ་ལ་ལ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས། ལ་ལ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་རོ། ། ཤཱ་རིའི་བུ་ངས་དེ་ལྟར་ལུས་གཅིག་ཡོངས་སུ་བཏང་བས་སེམས་ཅན་དེ་སྙེད་ཐེག་པ་གསུམ་དག་ལ་ཡོངས་སུ་སྨིན་པར་བྱས་སོ། ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཀྱི་སྐུ་ལ་གནས་པའི་རྫུ་འཕྲུལ་ཆེན་པོ་ཅི་འདྲ་བ་དང་། མཐུ་ཆེན་པོ་ཅི་འདྲ་བ་དང་། དབང་ཆེ་བར་གྲགས་པ་ཅི་འདྲ་བ་ལ་ལྟོས།
en: “Then, Śāriputra, when I had instructed, encouraged, inspired, and delighted this great host of beings with this talk on the Dharma, I disappeared. Śāriputra, with my superior ability I see that not a single one of those human beings who had come from all over the Jambu continent—women and men, boys and girls—who had eaten the flesh of the being Saumya, Śāriputra, fell into the lower realms of existence when the time of their death came. When they died, they were all reborn in the Heaven of the Thirty-Three, or in similar realms. Śāriputra, as I had instructed, encouraged, inspired, and delighted them with this talk on the Dharma, they were all firmly established in the three vehicles: the Śrāvakayāna, the Pratyekabuddhayāna, and the vehicle of unsurpassed omniscience. Some of them reached nirvāṇa, and some of them will reach nirvāṇa. Note, Śāriputra, that I was able to bring so many sentient beings to maturity in the three paths by giving up a single body. This is what the great magical abilities of a bodhisatva, a great being who masters the Dharma body, is like. This is what his great powers are like. This is what a renowned lord is like.” The venerable Śāriputra then asked the Lord, “Lord, what is the bodhisatva’s Dharma body like?”
